{
  "architectures": [
    "Mistral3ForConditionalGeneration"
  ],
  "dtype": "bfloat16",
  "image_token_index": 10,
  "model_type": "mistral3",
  "multimodal_projector_bias": false,
  "projector_hidden_act": "gelu",
  "quantization_config": {
    "bits": 3,
    "checkpoint_format": "gptq",
    "desc_act": false,
    "format": "gptq",
    "group_size": 128,
    "lm_head": false,
    "meta": {
      "act_group_aware": true,
      "auto_forward_data_parallel": true,
      "damp_auto_increment": 0.01,
      "damp_percent": 0.05,
      "dense_vram_strategy": "exclusive",
      "dense_vram_strategy_devices": null,
      "fallback": {
        "smooth": null,
        "strategy": "rtn",
        "threshold": "0.5%"
      },
      "foem": {
        "alpha": 0.0,
        "beta": 0.2,
        "device": "auto"
      },
      "gc_mode": "interval",
      "gptaq": null,
      "hessian": {
        "chunk_bytes": null,
        "chunk_size": null,
        "staging_dtype": "float32"
      },
      "mock_quantization": false,
      "moe_vram_strategy": "exclusive",
      "moe_vram_strategy_devices": null,
      "mse": 0.0,
      "offload_to_disk": false,
      "offload_to_disk_path": null,
      "pack_impl": "cpu",
      "quantizer": [
        "gptqmodel:7.1.0"
      ],
      "static_groups": false,
      "true_sequential": true,
      "uri": "https://github.com/modelcloud/gptqmodel",
      "wait_for_submodule_finalizers": false
    },
    "method": "gptq",
    "pack_dtype": "int32",
    "quant_method": "gptq",
    "sym": true
  },
  "rope_parameters": {
    "rope_theta": 10000.0,
    "rope_type": "default"
  },
  "spatial_merge_size": 2,
  "text_config": {
    "attention_dropout": 0.0,
    "bos_token_id": 1,
    "dtype": "bfloat16",
    "eos_token_id": 2,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 3072,
    "initializer_range": 0.02,
    "intermediate_size": 9216,
    "max_position_embeddings": 262144,
    "model_type": "ministral3",
    "num_attention_heads": 32,
    "num_hidden_layers": 26,
    "num_key_value_heads": 8,
    "pad_token_id": 11,
    "rms_norm_eps": 1e-05,
    "rope_parameters": {
      "beta_fast": 32.0,
      "beta_slow": 1.0,
      "factor": 16.0,
      "llama_4_scaling_beta": 0.1,
      "mscale": 1.0,
      "mscale_all_dim": 1.0,
      "original_max_position_embeddings": 16384,
      "rope_theta": 1000000.0,
      "rope_type": "yarn",
      "type": "yarn"
    },
    "sliding_window": null,
    "tie_word_embeddings": true,
    "use_cache": true,
    "vocab_size": 131072
  },
  "tie_word_embeddings": true,
  "transformers_version": "5.12.1",
  "use_cache": false,
  "vision_config": {
    "attention_dropout": 0.0,
    "dtype": "bfloat16",
    "head_dim": 64,
    "hidden_act": "silu",
    "hidden_size": 1024,
    "image_size": 1540,
    "initializer_range": 0.02,
    "intermediate_size": 4096,
    "model_type": "pixtral",
    "num_attention_heads": 16,
    "num_channels": 3,
    "num_hidden_layers": 24,
    "patch_size": 14,
    "rope_parameters": {
      "rope_theta": 10000.0,
      "rope_type": "default"
    }
  },
  "vision_feature_layer": -1
}
